; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v6)
		(pred_4 ?v8)
		(pred_3 ?v4)
		(pred_1 ?v4)
		(pred_6 ?v8 ?v4)
		(pred_2)
		(pred_5 ?v8))

   (:action op_2
       :parameters  (?v3 ?v5)
       :precondition (and (not-eq ?v3 ?v5) 
                          (pred_3 ?v3) (pred_3 ?v5) (pred_1 ?v3))
       :effect (and  (pred_1 ?v5)
		     (not (pred_1 ?v3))))


   (:action op_3
       :parameters (?v7 ?v2)
       :precondition  (and  (pred_4 ?v7) (pred_3 ?v2)
			    (pred_6 ?v7 ?v2) (pred_1 ?v2) (pred_2))
       :effect (and (pred_5 ?v7)
		    (not (pred_6 ?v7 ?v2)) 
		    (not (pred_2))))

   (:action op_1
       :parameters  (?v7  ?v2)
       :precondition  (and  (pred_4 ?v7) (pred_3 ?v2)
			    (pred_5 ?v7) (pred_1 ?v2))
       :effect (and (pred_6 ?v7 ?v2)
		    (pred_2)
		    (not (pred_5 ?v7)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_01 obj_03 obj_04 
          obj_05 obj_06 obj_02 
)
(:init
(pred_3 obj_01)
(pred_3 obj_03)
(pred_3 obj_04)
(pred_4 obj_05)
(pred_4 obj_06)
(pred_4 obj_02)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(pred_2)
(pred_6 obj_05 obj_01)
(pred_6 obj_06 obj_04)
(pred_6 obj_02 obj_03)
(pred_1 obj_03)
)
(:goal
(and
(pred_6 obj_05 obj_01)
(pred_6 obj_06 obj_01)
(pred_6 obj_02 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_06 obj_01) (pred_1 obj_03))
    (sometime-before  (pred_6 obj_02 obj_01) (pred_1 obj_04))
  )
)
)

; plan
1. (op_3 obj_02 obj_03)
   deleted: (pred_6 obj_02 obj_03) (pred_2)
   added: (pred_5 obj_02)
   goals met: 1 of 3
2. (op_2 obj_03 obj_04)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_04)
   goals met: 1 of 3
3. (op_1 obj_02 obj_04)
   deleted: (pred_5 obj_02)
   added: (pred_6 obj_02 obj_04) (pred_2)
   goals met: 1 of 3
4. (op_3 obj_06 obj_04)
   deleted: (pred_6 obj_06 obj_04) (pred_2)
   added: (pred_5 obj_06)
   goals met: 1 of 3
5. (op_2 obj_04 obj_01)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_01)
   goals met: 1 of 3
6. (op_1 obj_06 obj_01)
   deleted: (pred_5 obj_06)
   added: (pred_6 obj_06 obj_01) (pred_2)
   goals met: 2 of 3
7. (op_2 obj_01 obj_04)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_04)
   goals met: 2 of 3
8. (op_3 obj_02 obj_04)
   deleted: (pred_6 obj_02 obj_04) (pred_2)
   added: (pred_5 obj_02)
   goals met: 2 of 3
9. (op_2 obj_04 obj_01)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_01)
   goals met: 2 of 3
10. (op_1 obj_02 obj_01)
   deleted: (pred_5 obj_02)
   added: (pred_6 obj_02 obj_01) (pred_2)
   goals met: 3 of 3
